{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "flatten_8", "class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "dropout_15", "class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_8", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 600, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"name": "dropout_16", "class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["dense_16", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}