{"class_name": "Model", "config": {"name": "model_9", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "flatten_11", "class_name": "Flatten", "config": {"name": "flatten_11", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "units": 60, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_11", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "units": 60, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"name": "dense_31", "class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "units": 60, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_30", 0, 0, {}]]]}, {"name": "dense_32", "class_name": "Dense", "config": {"name": "dense_32", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_31", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_32", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}