{"class_name": "Model", "config": {"name": "model_29", "layers": [{"name": "input_29", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_29"}, "inbound_nodes": []}, {"name": "flatten_29", "class_name": "Flatten", "config": {"name": "flatten_29", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_29", 0, 0, {}]]]}, {"name": "dropout_43", "class_name": "Dropout", "config": {"name": "dropout_43", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_29", 0, 0, {}]]]}, {"name": "dense_70", "class_name": "Dense", "config": {"name": "dense_70", "trainable": true, "units": 250, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_43", 0, 0, {}]]]}, {"name": "dropout_44", "class_name": "Dropout", "config": {"name": "dropout_44", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_70", 0, 0, {}]]]}, {"name": "dense_71", "class_name": "Dense", "config": {"name": "dense_71", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_44", 0, 0, {}]]]}], "input_layers": [["input_29", 0, 0]], "output_layers": [["dense_71", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}